espressif/arduino-esp32/libraries/BLE/src/BLEAdvertisedDevice.cpp
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2020-2025 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 * Copyright 2017 Neil Kolban
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * BLEAdvertisedDevice.cpp
 *
 * During the scanning procedure, we will be finding advertised BLE devices.  This class
 * models a found device.
 *
 * See also:
 * https://www.bluetooth.com/specifications/assigned-numbers/generic-access-profile
 *
 *  Created on: Jul 3, 2017
 *      Author: kolban
 *
 *  Modified on: Feb 18, 2025
 *      Author: lucasssvaz (based on kolban's and h2zero's work)
 *      Description: Added support for NimBLE
 */

#include "soc/soc_caps.h"
#include "sdkconfig.h"
#if defined(SOC_BLE_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
#if defined(CONFIG_BLUEDROID_ENABLED) || defined(CONFIG_NIMBLE_ENABLED)

/***************************************************************************
 *                           Common includes                               *
 ***************************************************************************/

#include <sstream>
#include "BLEAdvertisedDevice.h"
#include "BLEUtils.h"
#include "esp32-hal-log.h"
#include <inttypes.h>

/***************************************************************************
 *                           Common functions                              *
 ***************************************************************************/

BLEAdvertisedDevice::BLEAdvertisedDevice() {
  m_adFlag = 0;
  m_appearance = 0;
  m_deviceType = 0;
  m_manufacturerData = "";
  m_name = "";
  m_rssi = -9999;
  m_serviceUUIDs = {};
  m_serviceData = {};
  m_serviceDataUUIDs = {};
  m_txPower = 0;
  m_pScan = nullptr;
  m_advType = 0;
  m_payload = nullptr;
  m_payloadLength = 0;

#if defined(CONFIG_NIMBLE_ENABLED)
  m_callbackSent = false;
#endif

  m_haveAppearance = false;
  m_haveManufacturerData = false;
  m_haveName = false;
  m_haveRSSI = false;
  m_haveTXPower = false;
  m_isLegacyAdv = true;
}  // BLEAdvertisedDevice

BLEAdvertisedDevice::~BLEAdvertisedDevice() {
  if (m_payload != nullptr) {
    free(m_payload);
    m_payload = nullptr;
    m_payloadLength = 0;
  }
}  // ~BLEAdvertisedDevice

BLEAdvertisedDevice::BLEAdvertisedDevice(const BLEAdvertisedDevice &other) {
  m_adFlag = other.m_adFlag;
  m_appearance = other.m_appearance;
  m_deviceType = other.m_deviceType;
  m_manufacturerData = other.m_manufacturerData;
  m_name = other.m_name;
  m_rssi = other.m_rssi;
  m_serviceUUIDs = other.m_serviceUUIDs;
  m_serviceData = other.m_serviceData;
  m_serviceDataUUIDs = other.m_serviceDataUUIDs;
  m_txPower = other.m_txPower;
  m_pScan = other.m_pScan;
  m_advType = other.m_advType;
  m_address = other.m_address;

#if defined(CONFIG_NIMBLE_ENABLED)
  m_callbackSent = other.m_callbackSent;
#endif

  m_haveAppearance = other.m_haveAppearance;
  m_haveManufacturerData = other.m_haveManufacturerData;
  m_haveName = other.m_haveName;
  m_haveRSSI = other.m_haveRSSI;
  m_haveTXPower = other.m_haveTXPower;
  m_isLegacyAdv = other.m_isLegacyAdv;

  // Deep copy the payload
  m_payloadLength = other.m_payloadLength;
  if (other.m_payload != nullptr && other.m_payloadLength > 0) {
    m_payload = (uint8_t *)malloc(m_payloadLength);
    if (m_payload != nullptr) {
      memcpy(m_payload, other.m_payload, m_payloadLength);
    } else {
      log_e("Failed to allocate %lu bytes for payload in copy constructor", (unsigned long)m_payloadLength);
      m_payloadLength = 0;
    }
  } else {
    m_payload = nullptr;
    m_payloadLength = 0;
  }
}  // BLEAdvertisedDevice copy constructor

BLEAdvertisedDevice &BLEAdvertisedDevice::operator=(const BLEAdvertisedDevice &other) {
  if (this == &other) {
    return *this;
  }

  m_adFlag = other.m_adFlag;
  m_appearance = other.m_appearance;
  m_deviceType = other.m_deviceType;
  m_manufacturerData = other.m_manufacturerData;
  m_name = other.m_name;
  m_rssi = other.m_rssi;
  m_serviceUUIDs = other.m_serviceUUIDs;
  m_serviceData = other.m_serviceData;
  m_serviceDataUUIDs = other.m_serviceDataUUIDs;
  m_txPower = other.m_txPower;
  m_pScan = other.m_pScan;
  m_advType = other.m_advType;
  m_address = other.m_address;

#if defined(CONFIG_NIMBLE_ENABLED)
  m_callbackSent = other.m_callbackSent;
#endif

  m_haveAppearance = other.m_haveAppearance;
  m_haveManufacturerData = other.m_haveManufacturerData;
  m_haveName = other.m_haveName;
  m_haveRSSI = other.m_haveRSSI;
  m_haveTXPower = other.m_haveTXPower;
  m_isLegacyAdv = other.m_isLegacyAdv;

  // Free existing payload and deep copy the new one
  if (m_payload != nullptr) {
    free(m_payload);
  }

  m_payloadLength = other.m_payloadLength;
  if (other.m_payload != nullptr && other.m_payloadLength > 0) {
    m_payload = (uint8_t *)malloc(m_payloadLength);
    if (m_payload != nullptr) {
      memcpy(m_payload, other.m_payload, m_payloadLength);
    } else {
      log_e("Failed to allocate %lu bytes for payload in assignment operator", (unsigned long)m_payloadLength);
      m_payloadLength = 0;
    }
  } else {
    m_payload = nullptr;
    m_payloadLength = 0;
  }

  return *this;
}  // BLEAdvertisedDevice assignment operator

bool BLEAdvertisedDevice::isLegacyAdvertisement() {
  return m_isLegacyAdv;
}

bool BLEAdvertisedDevice::isScannable() {
#if defined(CONFIG_BLUEDROID_ENABLED)
  return isLegacyAdvertisement() && (m_advType == ESP_BLE_EVT_CONN_ADV || m_advType == ESP_BLE_EVT_DISC_ADV);
#endif

